app/controllers/authors/posts_controller.rb

    def index
      if params[:category].blank?
---
SELECT "categories".* FROM "categories"

    def create
      @post = current_author.posts.new(post_params)

      respond_to do |format|
        if @post.save
---
INSERT INTO "posts" ("title", "body", "description", "slug", "created_at", "updated_at", "banner_image_url", "author_id", "category_id", "source", "url") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

    def update
      respond_to do |format|
        if @post.update(post_params)
---
UPDATE "posts" SET "banner_image_url" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["banner_image_url", "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRQkdHEUoosgMRhy_-i_jJtziLI18Hl94trthlIdoHcnLSXoPBM"], ["updated_at", "2017-12-11 14:19:53.722698"], ["id", 1]]