app/controllers/newsroom/posts_controller.rb

SELECT "categories".* FROM "categories"
SELECT  "categories".* FROM "categories" WHERE "categories"."name" = $1 LIMIT $2  [["name", "Best Of"], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."category_id" = $1 ORDER BY created_at DESC  [["category_id", 1]]
SELECT  "posts".* FROM "posts" ORDER BY created_at DESC LIMIT $1 OFFSET $2  [["LIMIT", 11], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."published" = $1  [["published", "t"]]
---
  def index
    if params[:category].blank?
      @posts = storage.list_for(params[:page], params[:tags])
    else
      @category_id = Category.find_by(name: params[:category]).id
      @posts = Post.where(category_id: @category_id).order("created_at DESC")
      @posts = Post.most_recent.published.paginate(:page => params[:page], per_page: 10)