app/views/authors/posts/_form.html.erb

            <div class="field">
              <%= form.collection_select :category_id, Category.all, :id, :name%>
---
SELECT "categories".* FROM "categories"