app/views/layouts/_navbar.html.erb

SELECT "categories".* FROM "categories"
---
      <li class="nav-item">
        <% Category.all.each do |category| %>